___

<a href='http://www.pieriandata.com'> <img src='./Pierian_Data_Logo.png' /></a>
___

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [344]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [345]:
df['col2'].unique() #returns a NumPy array of all the unique values in the column named 'col2' of the DataFrame df.

array([444, 555, 666], dtype=int64)

In [346]:
df['col2'].nunique()    #returns the number of unique values in the column 'col2' of the DataFrame df.
#or
# len(df['col2'].unique())

3

In [347]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [348]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [349]:
df['col2']>500  #It is just a boolean Series.as_integer_ratio

0    False
1     True
2     True
3    False
Name: col2, dtype: bool

In [350]:
df[df['col2']>500]  #It will return all the rows of the df where 'col2' column happens to be greater than 500.

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [351]:
#Select from DataFrame using criteria from multiple columns
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [352]:
def times2(x):
    return x*2

In [353]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [354]:
df['col1'].apply(times2)  # The .apply() method applies the given function to each element in the column (or each cell in a DataFrame).

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [355]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [356]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [357]:
'''
✅ df['col1'].sum()
This is correct and works as expected.
It calls the Series method .sum(), which adds up all the values in col1.
'''
df['col1'].sum()

10

In [358]:
# df['col1'].apply(sum)
'''
❌ df['col1'].apply(sum)
    This is incorrect for numeric Series like col1.
    .apply() applies a function (sum) to each element of the Series.
    But col1 contains integers, and sum(2) (or sum(4), etc.) is invalid — Python throws a TypeError because you can’t iterate over an integer.
''';

**Permanently Removing a Column**

In [359]:
# df.drop(1)  # By default, the .drop() method uses axis=0, so it drops the row with index 1.
#or
df.drop(df.index[1])  # Drops the row at position 1

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [360]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [361]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [362]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [363]:
del df['col1']

In [364]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [365]:
# The del statement in pandas can be used to delete columns, but not rows.
# del df.loc[1]  # ❌ Raises an error

**Get column and index names:**

In [366]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [367]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [368]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [369]:
df.sort_values(by='col2') #inplace=False by default         #It sorts the DataFrame rows based on the values in column 'col2'.
#Or
# df.sort_values('col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

**Find Null Values or Check for Null Values**

In [370]:
df['new'] = [45, np.nan, 23, np.nan]

In [371]:
df

   col2 col3   new
0   444  abc  45.0
1   555  def   NaN
2   666  ghi  23.0
3   444  xyz   NaN

In [372]:
df.isnull()

    col2   col3    new
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False   True

In [373]:
# Drop rows with NaN Values
df.dropna()
#or
# df.dropna(axis=0)

   col2 col3   new
0   444  abc  45.0
2   666  ghi  23.0

In [374]:
# Drop columns with NaN Values
df.dropna(axis=1)
'''
	col2	col3
0	444	    abc
1	555	    def
2	666	    ghi
3	444	    xyz
''';

**Filling in NaN values with something else:**

In [375]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [376]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [377]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [378]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [379]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns='C')   #By default aggfunc='sum'.
#Or
#pd.pivot_table(df, values='D', index=['A', 'B'], columns='C', aggfunc='sum')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Great Job!